stm32duino/Arduino_Core_STM32/libraries/Wire/src/utility/twi.c
#if !defined(STM32C0xx) && !defined(STM32F0xx) && !defined(STM32G0xx) && \
    !defined(STM32L0xx) && !defined(STM32U0xx) && !defined(STM32WB0x) && \
    !defined(STM32WL3x)
          obj->irqER = I2C2_ER_IRQn;
#endif /* !STM32F0xx && !STM32G0xx && !STM32L0xx && !STM32U0xx */
#endif /* USE_HALV2_DRIVER */
          i2c_handles[I2C2_INDEX] = &(obj->handle);
        }
#endif // I2C2_BASE
#if defined I2C3_BASE
        // Enable I2C3 clock if not done
        if (obj->i2c == I2C3) {
          __HAL_RCC_I2C3_CLK_ENABLE();
          __HAL_RCC_I2C3_FORCE_RESET();
          __HAL_RCC_I2C3_RELEASE_RESET();
          obj->irq = I2C3_EV_IRQn;
#if !defined(STM32G0xx) && !defined(STM32L0xx) && !defined(STM32U0xx)
          obj->irqER = I2C3_ER_IRQn;
#endif /* !STM32G0xx && !STM32L0xx && !STM32U0xx*/
          i2c_handles[I2C3_INDEX] = &(obj->handle);
        }
#endif // I2C3_BASE
#if defined I2C4_BASE
        // Enable I2C4 clock if not done
        if (obj->i2c == I2C4) {
          __HAL_RCC_I2C4_CLK_ENABLE();
          __HAL_RCC_I2C4_FORCE_RESET();
          __HAL_RCC_I2C4_RELEASE_RESET();
          obj->irq = I2C4_EV_IRQn;
#if !defined(STM32U0xx)
          obj->irqER = I2C4_ER_IRQn;
#endif /* !STM32U0xx */
          i2c_handles[I2C4_INDEX] = &(obj->handle);
        }
#endif // I2C4_BASE
#if defined I2C5_BASE
        // Enable I2C5 clock if not done
        if (obj->i2c == I2C5) {
          __HAL_RCC_I2C5_CLK_ENABLE();
          __HAL_RCC_I2C5_FORCE_RESET();
          __HAL_RCC_I2C5_RELEASE_RESET();
          obj->irq = I2C5_EV_IRQn;
          obj->irqER = I2C5_ER_IRQn;
          i2c_handles[I2C5_INDEX] = &(obj->handle);
        }
#endif // I2C5_BASE
#if defined I2C6_BASE
        // Enable I2C6 clock if not done
        if (obj->i2c == I2C6) {
          __HAL_RCC_I2C6_CLK_ENABLE();
          __HAL_RCC_I2C6_FORCE_RESET();
          __HAL_RCC_I2C6_RELEASE_RESET();
          obj->irq = I2C6_EV_IRQn;
          obj->irqER = I2C6_ER_IRQn;
          i2c_handles[I2C6_INDEX] = &(obj->handle);
        }
#endif // I2C6_BASE

        /* Configure I2C GPIO pins */
        pinmap_pinout(obj->scl, PinMap_I2C_SCL);
        pinmap_pinout(obj->sda, PinMap_I2C_SDA);

#if defined(USE_HALV2_DRIVER)
        hal_i2c_handle_t *handle = &(obj->handle);
        hal_i2c_config_t i2c_config;
        HAL_I2C_Init(handle, (hal_i2c_t)obj->i2c);
        i2c_config.timing = i2c_getTiming(obj, timing);
        i2c_config.own_address1 = ownAddress;
        i2c_config.addressing_mode = HAL_I2C_ADDRESSING_7BIT;
        HAL_I2C_SetConfig(handle, &i2c_config);

        if (obj->generalCall) {
          HAL_I2C_SLAVE_EnableAckGeneralCall(handle);
        } else {
          HAL_I2C_SLAVE_DisableAckGeneralCall(handle);
        }
        if (obj->NoStretchMode) {
          HAL_I2C_SLAVE_EnableClockStretching(handle);
        } else {
          HAL_I2C_SLAVE_DisableClockStretching(handle);
        }

        HAL_CORTEX_NVIC_SetPriority(obj->irq, I2C_IRQ_PRIO, I2C_IRQ_SUBPRIO);
        HAL_CORTEX_NVIC_EnableIRQ(obj->irq);
        HAL_CORTEX_NVIC_SetPriority(obj->irqER, I2C_IRQ_PRIO, I2C_IRQ_SUBPRIO);
        HAL_CORTEX_NVIC_EnableIRQ(obj->irqER);
#else
        I2C_HandleTypeDef *handle = &(obj->handle);

        handle->Instance             = obj->i2c;
#ifdef I2C_TIMING
        handle->Init.Timing          = i2c_getTiming(obj, timing);
#else
        handle->Init.ClockSpeed      = i2c_getTiming(obj, timing);
        /* Standard mode (sm) is up to 100kHz, then it's Fast mode (fm)     */
        /* In fast mode duty cyble bit must be set in CCR register          */
        if (timing > 100000) {
          handle->Init.DutyCycle       = I2C_DUTYCYCLE_16_9;
        } else {
          handle->Init.DutyCycle       = I2C_DUTYCYCLE_2;
        }
#endif
        handle->Init.OwnAddress1     = ownAddress;
        handle->Init.OwnAddress2     = 0;
        handle->Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;
        handle->Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
        handle->Init.GeneralCallMode = (obj->generalCall) ? I2C_GENERALCALL_ENABLE : I2C_GENERALCALL_DISABLE;
        handle->Init.NoStretchMode   = (obj->NoStretchMode) ? I2C_NOSTRETCH_ENABLE : I2C_NOSTRETCH_DISABLE;

        handle->State = HAL_I2C_STATE_RESET;

        HAL_NVIC_SetPriority(obj->irq, I2C_IRQ_PRIO, I2C_IRQ_SUBPRIO);
        HAL_NVIC_EnableIRQ(obj->irq);
#if !defined(STM32C0xx) && !defined(STM32F0xx) && !defined(STM32G0xx) && \
    !defined(STM32L0xx) && !defined(STM32U0xx)
        HAL_NVIC_SetPriority(obj->irqER, I2C_IRQ_PRIO, I2C_IRQ_SUBPRIO);
        HAL_NVIC_EnableIRQ(obj->irqER);
#endif /* !STM32C0xx && !STM32F0xx && !STM32G0xx && !STM32L0xx && !STM32U0xx */

        /* Init the I2C */
        if (HAL_I2C_Init(handle) != HAL_OK) {
          /* Initialization Error */
          Error_Handler();
        }
#endif
        /* Initialize default values */
        obj->slaveRxNbData = 0;
        obj->slaveMode = SLAVE_MODE_LISTEN;
      }
    }
  }
}

/**
  * @brief  Initialize and setup GPIO and I2C peripheral
  * @param  obj : pointer to i2c_t structure
  * @retval none
  */
void i2c_deinit(i2c_t *obj)
{
#if defined(USE_HALV2_DRIVER)
  HAL_CORTEX_NVIC_DisableIRQ(obj->irq);
  HAL_CORTEX_NVIC_DisableIRQ(obj->irqER);
#else
  HAL_NVIC_DisableIRQ(obj->irq);
#if !defined(STM32C0xx) && !defined(STM32F0xx) && !defined(STM32G0xx) && \
    !defined(STM32L0xx) && !defined(STM32U0xx)
  HAL_NVIC_DisableIRQ(obj->irqER);
#endif /* !STM32C0xx && !STM32F0xx && !STM32G0xx && !STM32L0xx && !STM32U0xx */
#endif /* USE_HALV2_DRIVER */
  HAL_I2C_DeInit(&(obj->handle));
  /* Reset I2C GPIO pins as INPUT_ANALOG */
  pin_function(obj->scl, STM_PIN_DATA(STM_MODE_ANALOG, LL_GPIO_PULL_NO, 0));
  pin_function(obj->sda, STM_PIN_DATA(STM_MODE_ANALOG, LL_GPIO_PULL_NO, 0));
  // Reset I2Cx and disable clock
#if defined I2C1_BASE
  if (obj->i2c == I2C1) {
#if defined(USE_HALV2_DRIVER)
    HAL_RCC_I2C1_Reset();
    HAL_RCC_I2C1_DisableClock();
#else
    __HAL_RCC_I2C1_FORCE_RESET();
    __HAL_RCC_I2C1_RELEASE_RESET();
    __HAL_RCC_I2C1_CLK_DISABLE();
#endif
  }
#endif // I2C1_BASE
#if defined I2C2_BASE
  if (obj->i2c == I2C2) {
#if defined(USE_HALV2_DRIVER)
    HAL_RCC_I2C2_Reset();
    HAL_RCC_I2C2_DisableClock();
#else
    __HAL_RCC_I2C2_FORCE_RESET();
    __HAL_RCC_I2C2_RELEASE_RESET();
    __HAL_RCC_I2C2_CLK_DISABLE();
#endif
  }
#endif // I2C2_BASE
#if defined I2C3_BASE
  if (obj->i2c == I2C3) {
    __HAL_RCC_I2C3_FORCE_RESET();
    __HAL_RCC_I2C3_RELEASE_RESET();
    __HAL_RCC_I2C3_CLK_DISABLE();
  }
#endif // I2C3_BASE
#if defined I2C4_BASE
  if (obj->i2c == I2C4) {
    __HAL_RCC_I2C4_FORCE_RESET();
    __HAL_RCC_I2C4_RELEASE_RESET();
    __HAL_RCC_I2C4_CLK_DISABLE();
  }
#endif // I2C4_BASE
#if defined I2C5_BASE
  if (obj->i2c == I2C5) {
    __HAL_RCC_I2C5_FORCE_RESET();
    __HAL_RCC_I2C5_RELEASE_RESET();
    __HAL_RCC_I2C5_CLK_DISABLE();
  }
#endif // I2C5_BASE
#if defined I2C6_BASE
  if (obj->i2c == I2C6) {
    __HAL_RCC_I2C6_FORCE_RESET();
    __HAL_RCC_I2C6_RELEASE_RESET();
    __HAL_RCC_I2C6_CLK_DISABLE();
  }
#endif // I2C6_BASE
}

/**
  * @brief  Setup transmission speed. I2C must be configured before.
  * @param  obj : pointer to i2c_t structure
  * @param  frequency : i2c transmission speed
  * @retval none
  */
void i2c_setTiming(i2c_t *obj, uint32_t frequency)
{
  uint32_t f = i2c_getTiming(obj, frequency);
  LL_I2C_Disable(obj->i2c);

#ifdef I2C_TIMING
  LL_I2C_SetTiming(obj->i2c, f);
#if !defined(USE_HALV2_DRIVER)
  obj->handle.Init.Timing = f;
#endif /* !USE_HALV2_DRIVER */
#else
  obj->handle.Init.ClockSpeed = f;
  /* Standard mode (sm) is up to 100kHz, then it's Fast mode (fm)     */
  /* In fast mode duty cyble bit must be set in CCR register          */
  if (frequency > 100000) {
    obj->handle.Init.DutyCycle       = I2C_DUTYCYCLE_16_9;
  } else {
    obj->handle.Init.DutyCycle       = I2C_DUTYCYCLE_2;
  }
  HAL_I2C_Init(&(obj->handle));
#endif
  LL_I2C_Enable(obj->i2c);
}

/**
  * @brief  Write bytes at a given address
  * @param  obj : pointer to i2c_t structure
  * @param  dev_address: specifies the address of the device.
  * @param  data: pointer to data to be write
  * @param  size: number of bytes to be write.
  * @retval read status
  */
i2c_status_e i2c_master_write(i2c_t *obj, uint8_t dev_address,
                              uint8_t *data, uint16_t size)

{
  i2c_status_e ret = I2C_OK;
  uint32_t tickstart = HAL_GetTick();
  uint32_t delta = 0;
  uint32_t err = 0;


  /* When size is 0, this is usually an I2C scan / ping to check if device is there and ready */
  if (size == 0) {
    ret = i2c_IsDeviceReady(obj, dev_address, 1);
  } else {
#if defined(USE_HALV2_DRIVER)
    hal_status_t status = HAL_OK;

