stm32duino/Arduino_Core_STM32/libraries/Wire/src/utility/twi.c
    hal_i2c_xfer_opt_t XferOptions = obj->handle.xfer_opt;
    do {
      status = HAL_I2C_MASTER_SEQ_Transmit_IT(&(obj->handle), dev_address, data, size, XferOptions);
      // Ensure i2c ready
      if (status == HAL_BUSY) {
        delta = (HAL_GetTick() - tickstart);
        if (delta > I2C_TIMEOUT_TICK) {
          ret = I2C_BUSY;
          break;
        }
      } else {
        ret = (status == HAL_OK) ? I2C_OK : I2C_ERROR;
      }
    } while (status == HAL_BUSY);

    if (ret == I2C_OK) {
      tickstart = HAL_GetTick();
      // wait for transfer completion
      while ((HAL_I2C_GetState(&(obj->handle)) != HAL_I2C_STATE_IDLE) && (delta < I2C_TIMEOUT_TICK)) {
        delta = (HAL_GetTick() - tickstart);
        if (HAL_I2C_GetLastErrorCodes(&(obj->handle)) != HAL_I2C_ERROR_NONE) {
          break;
        }
      }

      err = HAL_I2C_GetLastErrorCodes(&(obj->handle));
      if ((delta >= I2C_TIMEOUT_TICK) || (status == HAL_TIMEOUT)) {
        ret = I2C_TIMEOUT;
      } else {
        if ((err & HAL_I2C_ERROR_AF) == HAL_I2C_ERROR_AF) {
          ret = I2C_NACK_DATA;
        } else if (err != HAL_I2C_ERROR_NONE) {
          ret = I2C_ERROR;
        }
      }
    }
#else
    HAL_StatusTypeDef status = HAL_OK;
#if defined(I2C_OTHER_FRAME)
    uint32_t XferOptions = obj->handle.XferOptions; // save XferOptions value, because handle can be modified by HAL, which cause issue in case of NACK from slave
#endif
    do {
#if defined(I2C_OTHER_FRAME)
      status = HAL_I2C_Master_Seq_Transmit_IT(&(obj->handle), dev_address, data, size, XferOptions);
#else
      status = HAL_I2C_Master_Transmit_IT(&(obj->handle), dev_address, data, size);
#endif
      // Ensure i2c ready
      if (status == HAL_BUSY) {
        delta = (HAL_GetTick() - tickstart);
        if (delta > I2C_TIMEOUT_TICK) {
          ret = I2C_BUSY;
          break;
        }
      } else {
        ret = (status == HAL_OK) ? I2C_OK : I2C_ERROR;
      }
    } while (status == HAL_BUSY);

    if (ret == I2C_OK) {
      tickstart = HAL_GetTick();
      // wait for transfer completion
      while ((HAL_I2C_GetState(&(obj->handle)) != HAL_I2C_STATE_READY) && (delta < I2C_TIMEOUT_TICK)) {
        delta = (HAL_GetTick() - tickstart);
        if (HAL_I2C_GetError(&(obj->handle)) != HAL_I2C_ERROR_NONE) {
          break;
        }
      }

      err = HAL_I2C_GetError(&(obj->handle));
      if ((delta >= I2C_TIMEOUT_TICK)
          || ((err & HAL_I2C_ERROR_TIMEOUT) == HAL_I2C_ERROR_TIMEOUT)) {
        ret = I2C_TIMEOUT;
      } else {
        if ((err & HAL_I2C_ERROR_AF) == HAL_I2C_ERROR_AF) {
          ret = I2C_NACK_DATA;
        } else if (err != HAL_I2C_ERROR_NONE) {
          ret = I2C_ERROR;
        }
      }
    }
#endif /* USE_HALV2_DRIVER */
  }
  return ret;
}

/**
  * @brief  Write bytes to master
  * @param  obj : pointer to i2c_t structure
  * @param  data: pointer to data to be write
  * @param  size: number of bytes to be write.
  * @retval status
  */
i2c_status_e i2c_slave_write_IT(i2c_t *obj, uint8_t *data, uint16_t size)
{
  uint8_t i = 0;
  i2c_status_e ret = I2C_OK;

  // Protection to not override the TxBuffer
  if (size > I2C_TXRX_BUFFER_SIZE) {
    ret = I2C_DATA_TOO_LONG;
  } else {
    // Check the communication status
    for (i = 0; i < size; i++) {
      obj->i2cTxRxBuffer[obj->i2cTxRxBufferSize + i] = *(data + i);
    }

    obj->i2cTxRxBufferSize += size;
  }
  return ret;
}

/**
  * @brief  read bytes in master mode at a given address
  * @param  obj : pointer to i2c_t structure
  * @param  dev_address: specifies the address of the device.
  * @param  data: pointer to data to be read
  * @param  size: number of bytes to be read.
  * @retval read status
  */
i2c_status_e i2c_master_read(i2c_t *obj, uint8_t dev_address, uint8_t *data, uint16_t size)
{
  i2c_status_e ret = I2C_OK;
  uint32_t tickstart = HAL_GetTick();
  uint32_t delta = 0;
  uint32_t err = 0;
#if defined(USE_HALV2_DRIVER)
  hal_status_t status = HAL_OK;
  hal_i2c_xfer_opt_t XferOptions = obj->handle.xfer_opt;
  do {
    status = HAL_I2C_MASTER_SEQ_Receive_IT(&(obj->handle), dev_address, data, size, XferOptions);
    // Ensure i2c ready
    if (status == HAL_BUSY) {
      delta = (HAL_GetTick() - tickstart);
      if (delta > I2C_TIMEOUT_TICK) {
        ret = I2C_BUSY;
        break;
      }
    } else {
      ret = (status == HAL_OK) ? I2C_OK : I2C_ERROR;
    }
  } while (status == HAL_BUSY);

  if (ret == I2C_OK) {
    tickstart = HAL_GetTick();
    // wait for transfer completion
    while ((HAL_I2C_GetState(&(obj->handle)) != HAL_I2C_STATE_IDLE) && (delta < I2C_TIMEOUT_TICK)) {
      delta = (HAL_GetTick() - tickstart);
      if (HAL_I2C_GetLastErrorCodes(&(obj->handle)) != HAL_I2C_ERROR_NONE) {
        break;
      }
    }

    err = HAL_I2C_GetLastErrorCodes(&(obj->handle));
    if ((delta >= I2C_TIMEOUT_TICK)  || (status == HAL_TIMEOUT)) {
      ret = I2C_TIMEOUT;
    } else {
      if ((err & HAL_I2C_ERROR_AF) == HAL_I2C_ERROR_AF) {
        ret = I2C_NACK_DATA;
      } else if (err != HAL_I2C_ERROR_NONE) {
        ret = I2C_ERROR;
      }
    }
  }

#else
  HAL_StatusTypeDef status = HAL_OK;

#if defined(I2C_OTHER_FRAME)
  uint32_t XferOptions = obj->handle.XferOptions; // save XferOptions value, because handle can be modified by HAL, which cause issue in case of NACK from slave
#endif
  do {
#if defined(I2C_OTHER_FRAME)
    status = HAL_I2C_Master_Seq_Receive_IT(&(obj->handle), dev_address, data, size, XferOptions);
#else
    status = HAL_I2C_Master_Receive_IT(&(obj->handle), dev_address, data, size);
#endif
    // Ensure i2c ready
    if (status == HAL_BUSY) {
      delta = (HAL_GetTick() - tickstart);
      if (delta > I2C_TIMEOUT_TICK) {
        ret = I2C_BUSY;
        break;
      }
    } else {
      ret = (status == HAL_OK) ? I2C_OK : I2C_ERROR;
    }
  } while (status == HAL_BUSY);

  if (ret == I2C_OK) {
    tickstart = HAL_GetTick();
    // wait for transfer completion
    while ((HAL_I2C_GetState(&(obj->handle)) != HAL_I2C_STATE_READY) && (delta < I2C_TIMEOUT_TICK)) {
      delta = (HAL_GetTick() - tickstart);
      if (HAL_I2C_GetError(&(obj->handle)) != HAL_I2C_ERROR_NONE) {
        break;
      }
    }

    err = HAL_I2C_GetError(&(obj->handle));
    if ((delta >= I2C_TIMEOUT_TICK)
        || ((err & HAL_I2C_ERROR_TIMEOUT) == HAL_I2C_ERROR_TIMEOUT)) {
      ret = I2C_TIMEOUT;
    } else {
      if ((err & HAL_I2C_ERROR_AF) == HAL_I2C_ERROR_AF) {
        ret = I2C_NACK_DATA;
      } else if (err != HAL_I2C_ERROR_NONE) {
        ret = I2C_ERROR;
      }
    }
  }
#endif /* USE_HALV2_DRIVER */
  return ret;
}

/**
  * @brief  Checks if target device is ready for communication
  * @param  obj : pointer to i2c_t structure
  * @param  devAddr: specifies the address of the device.
  * @param  trials : Number of trials.
  * @retval status
  */
i2c_status_e i2c_IsDeviceReady(i2c_t *obj, uint8_t devAddr, uint32_t trials)
{
  i2c_status_e ret = I2C_OK;
#if defined(USE_HALV2_DRIVER)
  (void)trials; // Not used in HAL V2, kept as parameter for compatibility with HAL V1
  switch (HAL_I2C_MASTER_PollForSlaveReady(&(obj->handle), devAddr, I2C_TIMEOUT_TICK)) {
    case HAL_OK:
      ret = I2C_OK;
      break;
    case HAL_TIMEOUT:
      ret = (obj->handle.global_state != HAL_I2C_STATE_IDLE) ? I2C_TIMEOUT : I2C_NACK_ADDR;
      break;
    case HAL_BUSY:
      ret = (obj->handle.global_state != HAL_I2C_STATE_IDLE) ? I2C_BUSY : I2C_NACK_ADDR;
      break;
    default:
      ret = (obj->handle.global_state != HAL_I2C_STATE_IDLE) ? I2C_ERROR : I2C_NACK_ADDR;
      break;
  }
#else
  switch (HAL_I2C_IsDeviceReady(&(obj->handle), devAddr, trials, I2C_TIMEOUT_TICK)) {
    case HAL_OK:
      ret = I2C_OK;
      break;
    case HAL_TIMEOUT:
      ret = (obj->handle.State != HAL_I2C_STATE_READY) ? I2C_TIMEOUT : I2C_NACK_ADDR;
      break;
    case HAL_BUSY:
      ret = (obj->handle.State != HAL_I2C_STATE_READY) ? I2C_BUSY : I2C_NACK_ADDR;
      break;
    default:
      ret = (obj->handle.State != HAL_I2C_STATE_READY) ? I2C_ERROR : I2C_NACK_ADDR;
      break;
  }
#endif
  return ret;
}

/* Aim of the function is to get i2c_s pointer using hi2c pointer */
/* Highly inspired from magical linux kernel's "container_of" */
/* (which was not directly used since not compatible with IAR toolchain) */
#if defined(USE_HALV2_DRIVER)
i2c_t *get_i2c_obj(hal_i2c_handle_t *hi2c)
#else
i2c_t *get_i2c_obj(I2C_HandleTypeDef *hi2c)
#endif
{
  struct i2c_s *obj_s;
  i2c_t *obj;

