stm32duino/Arduino_Core_STM32/libraries/Wire/src/utility/twi.c
  obj_s = (struct i2c_s *)((char *)hi2c - offsetof(struct i2c_s, handle));
  obj = (i2c_t *)((char *)obj_s - offsetof(i2c_t, i2c));

  return (obj);
}

/** @brief  sets function called before a slave read operation
  * @param  obj : pointer to i2c_t structure
  * @param  function: callback function to use
  * @retval None
  */
void i2c_attachSlaveRxEvent(i2c_t *obj, void (*function)(i2c_t *))
{
  if ((obj != NULL) && (function != NULL)) {
    obj->i2c_onSlaveReceive = function;
#if defined(USE_HALV2_DRIVER)
    HAL_I2C_SLAVE_EnableListen_IT(&(obj->handle));
#else
    HAL_I2C_EnableListen_IT(&(obj->handle));
#endif
  }
}

/** @brief  sets function called before a slave write operation
  * @param  obj : pointer to i2c_t structure
  * @param  function: callback function to use
  * @retval None
  */
void i2c_attachSlaveTxEvent(i2c_t *obj, void (*function)(i2c_t *))
{
  if ((obj != NULL) && (function != NULL)) {
    obj->i2c_onSlaveTransmit = function;
#if defined(USE_HALV2_DRIVER)
    HAL_I2C_SLAVE_EnableListen_IT(&(obj->handle));
#else
    HAL_I2C_EnableListen_IT(&(obj->handle));
#endif
  }
}

/**
  * @brief  Slave Address Match callback.
  * @param  hi2c Pointer to a I2C_HandleTypeDef or hal_i2c_handle_t structure that contains
  *                the configuration information for the specified I2C.
  * @param  TransferDirection: Master request Transfer Direction (Write/Read), value of @ref I2C_XferOptions_definition
  * @param  AddrMatchCode: Address Match Code
  * @retval None
  */
#if defined(USE_HALV2_DRIVER)
void HAL_I2C_SLAVE_AddrCallback(hal_i2c_handle_t *hi2c, hal_i2c_slave_xfer_direction_t TransferDirection,
                                uint32_t AddrMatchCode)
#else
void HAL_I2C_AddrCallback(I2C_HandleTypeDef *hi2c, uint8_t TransferDirection, uint16_t AddrMatchCode)
#endif
{
  (void)AddrMatchCode;
  i2c_t *obj = get_i2c_obj(hi2c);
  if ((obj->slaveMode == SLAVE_MODE_RECEIVE) && (obj->slaveRxNbData != 0)) {
    obj->i2c_onSlaveReceive(obj);
    obj->slaveMode = SLAVE_MODE_LISTEN;
    obj->slaveRxNbData = 0;
  }
#if defined(USE_HALV2_DRIVER)
  if (TransferDirection == HAL_I2C_SLAVE_DIRECTION_RECEIVE)
#else
  if (TransferDirection == I2C_DIRECTION_RECEIVE)
#endif
  {
    obj->slaveMode = SLAVE_MODE_TRANSMIT;

    if (obj->i2c_onSlaveTransmit != NULL) {
      obj->i2cTxRxBufferSize = 0;
      obj->i2c_onSlaveTransmit(obj);
    }
#if defined(USE_HALV2_DRIVER)
    HAL_I2C_SLAVE_SEQ_Transmit_IT(hi2c, (uint8_t *) obj->i2cTxRxBuffer,
                                  obj->i2cTxRxBufferSize, HAL_I2C_XFER_LAST_FRAME);
#else
    HAL_I2C_Slave_Seq_Transmit_IT(hi2c, (uint8_t *) obj->i2cTxRxBuffer,
                                  obj->i2cTxRxBufferSize, I2C_LAST_FRAME);
#endif
  } else {
    obj->slaveRxNbData = 0;
    obj->slaveMode = SLAVE_MODE_RECEIVE;
    /*  We don't know in advance how many bytes will be sent by master so
     *  we'll fetch one by one until master ends the sequence */
#if defined(USE_HALV2_DRIVER)
    HAL_I2C_SLAVE_SEQ_Receive_IT(hi2c, (uint8_t *) & (obj->i2cTxRxBuffer[obj->slaveRxNbData]),
                                 1, HAL_I2C_XFER_NEXT_FRAME);
#else
    HAL_I2C_Slave_Seq_Receive_IT(hi2c, (uint8_t *) & (obj->i2cTxRxBuffer[obj->slaveRxNbData]),
                                 1, I2C_NEXT_FRAME);
#endif
  }
}

/**
  * @brief  Listen Complete callback.
  * @param  hi2c Pointer to a I2C_HandleTypeDef or hal_i2c_handle_t structure that contains
  *                the configuration information for the specified I2C.
  * @retval None
  */
#if defined(USE_HALV2_DRIVER)
void HAL_I2C_SLAVE_ListenCpltCallback(hal_i2c_handle_t *hi2c)
#else
void HAL_I2C_ListenCpltCallback(I2C_HandleTypeDef *hi2c)
#endif
{
  i2c_t *obj = get_i2c_obj(hi2c);

  /*  Previous master transaction now ended, so inform upper layer if needed
   *  then prepare for listening to next request */
  if ((obj->slaveMode == SLAVE_MODE_RECEIVE) && (obj->slaveRxNbData != 0)) {
    obj->i2c_onSlaveReceive(obj);
  }
  obj->slaveMode = SLAVE_MODE_LISTEN;
  obj->slaveRxNbData = 0;
#if defined(USE_HALV2_DRIVER)
  HAL_I2C_SLAVE_EnableListen_IT(hi2c);
#else
  HAL_I2C_EnableListen_IT(hi2c);
#endif
}

/**
  * @brief Slave RX complete callback
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @retval None
  */
#if defined(USE_HALV2_DRIVER)
void HAL_I2C_SLAVE_RxCpltCallback(hal_i2c_handle_t *hi2c)
#else
void HAL_I2C_SlaveRxCpltCallback(I2C_HandleTypeDef *hi2c)
#endif
{
  i2c_t *obj = get_i2c_obj(hi2c);
  /* One more byte was received, store it then prepare next */
  if (obj->slaveRxNbData < I2C_TXRX_BUFFER_SIZE) {
    obj->slaveRxNbData++;
  } else {
    core_debug("ERROR: I2C Slave RX overflow\n");
  }
  /* Restart interrupt mode for next Byte */
  if (obj->slaveMode == SLAVE_MODE_RECEIVE) {
#if defined(USE_HALV2_DRIVER)
    HAL_I2C_SLAVE_SEQ_Receive_IT(hi2c, (uint8_t *) & (obj->i2cTxRxBuffer[obj->slaveRxNbData]),
                                 1, HAL_I2C_XFER_NEXT_FRAME);
#else
    HAL_I2C_Slave_Seq_Receive_IT(hi2c, (uint8_t *) & (obj->i2cTxRxBuffer[obj->slaveRxNbData]),
                                 1, I2C_NEXT_FRAME);
#endif
  }
}

/**
  * @brief Slave TX complete callback
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @retval None
  */
#if defined(USE_HALV2_DRIVER)
void HAL_I2C_SLAVE_TxCpltCallback(hal_i2c_handle_t *hi2c)
#else
void HAL_I2C_SlaveTxCpltCallback(I2C_HandleTypeDef *hi2c)
#endif
{
  i2c_t *obj = get_i2c_obj(hi2c);
  /* Reset transmit buffer size */
  obj->i2cTxRxBufferSize = 0;
}

/**
  * @brief  I2C error callback.
  * @note   In master mode, the callback is not used because the error is reported
  *         to the Arduino API from i2c_master_write() and i2c_master_read().
  *         In slave mode, there is no mechanism in Arduino API to report an error
  *         so the error callback forces the slave to listen again.
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @retval None
  */
#if defined(USE_HALV2_DRIVER)
void HAL_I2C_ErrorCallback(hal_i2c_handle_t *hi2c)
#else
void HAL_I2C_ErrorCallback(I2C_HandleTypeDef *hi2c)
#endif
{
  i2c_t *obj = get_i2c_obj(hi2c);

  if (!obj->isMaster) {
#if defined(USE_HALV2_DRIVER)
    HAL_I2C_SLAVE_EnableListen_IT(hi2c);
#else
    HAL_I2C_EnableListen_IT(hi2c);
#endif
  }
}

