stm32duino/Arduino_Core_STM32/libraries/Wire/src/utility/twi.c
#if defined(I2C1_BASE)
/**
* @brief  This function handles I2C1 interrupt.
* @param  None
* @retval None
*/
void I2C1_EV_IRQHandler(void)
{
#if defined(USE_HALV2_DRIVER)
  hal_i2c_handle_t *handle = i2c_handles[I2C1_INDEX];
#else
  I2C_HandleTypeDef *handle = i2c_handles[I2C1_INDEX];
#endif
  HAL_I2C_EV_IRQHandler(handle);
#if defined(STM32C0xx) || defined(STM32F0xx) || defined(STM32G0xx) || \
    defined(STM32L0xx) || defined(STM32U0xx)
  HAL_I2C_ER_IRQHandler(handle);
#endif /* STM32C0xx || STM32F0xx || STM32G0xx || STM32L0xx || STM32U0xx*/
}

#if defined(STM32C5xx)
/**
* @brief  This function handles I2C1 error interrupt.
* @param  None
* @retval None
*/
void I2C1_ERR_IRQHandler(void)
{
  hal_i2c_handle_t *handle = i2c_handles[I2C1_INDEX];
  HAL_I2C_ERR_IRQHandler(handle);
}
#elif !defined(STM32C0xx) && !defined(STM32F0xx) && !defined(STM32G0xx) && \
    !defined(STM32L0xx) && !defined(STM32U0xx)
/**
* @brief  This function handles I2C1 error interrupt.
* @param  None
* @retval None
*/
void I2C1_ER_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C1_INDEX];
  HAL_I2C_ER_IRQHandler(handle);
}
#endif /* !STM32C0xx && !STM32F0xx && !STM32G0xx && !STM32L0xx && !STM32U0xx */
#endif // I2C1_BASE

#if defined(I2C2_BASE)
/**
* @brief  This function handles I2C2 interrupt.
* @param  None
* @retval None
*/
void I2C2_EV_IRQHandler(void)
{
#if defined(I2C3_BASE) && (defined(STM32G0xx) || defined(STM32U0xx))
  /* I2C2_3_IRQHandler */
  I2C_HandleTypeDef *handle2 = i2c_handles[I2C2_INDEX];
  I2C_HandleTypeDef *handle3 = i2c_handles[I2C3_INDEX];
  if (handle2) {
    HAL_I2C_EV_IRQHandler(handle2);
    HAL_I2C_ER_IRQHandler(handle2);
  }
  if (handle3) {
    HAL_I2C_EV_IRQHandler(handle3);
    HAL_I2C_ER_IRQHandler(handle3);
  }
#if defined(I2C4_BASE)
  /* I2C2_3_4_IRQHandler */
  I2C_HandleTypeDef *handle4 = i2c_handles[I2C4_INDEX];
  if (handle4) {
    HAL_I2C_EV_IRQHandler(handle4);
    HAL_I2C_ER_IRQHandler(handle4);
  }
#endif /* I2C4_BASE */
#else
#if defined(USE_HALV2_DRIVER)
  hal_i2c_handle_t *handle = i2c_handles[I2C2_INDEX];
#else
  I2C_HandleTypeDef *handle = i2c_handles[I2C2_INDEX];
#endif
  HAL_I2C_EV_IRQHandler(handle);
#if defined(STM32F0xx) || defined(STM32G0xx) || defined(STM32L0xx) || \
    defined(STM32U0xx)
  HAL_I2C_ER_IRQHandler(handle);
#endif /* STM32F0xx || STM32G0xx || STM32L0xx || STM32U0xx*/
#endif
}

#if defined(STM32C5xx)
/**
* @brief  This function handles I2C2 error interrupt.
* @param  None
* @retval None
*/
void I2C2_ERR_IRQHandler(void)
{
  hal_i2c_handle_t *handle = i2c_handles[I2C2_INDEX];
  HAL_I2C_ERR_IRQHandler(handle);
}
#elif !defined(STM32F0xx) && !defined(STM32G0xx) && !defined(STM32L0xx) && \
    !defined(STM32U0xx)
/**
* @brief  This function handles I2C2 error interrupt.
* @param  None
* @retval None
*/
void I2C2_ER_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C2_INDEX];
  HAL_I2C_ER_IRQHandler(handle);
}
#endif /* !STM32F0xx && !STM32G0xx && !STM32L0xx && !STM32U0xx */
#endif // I2C2_BASE

#if defined(I2C3_BASE) && !defined(STM32G0xx) && !defined(STM32U0xx)
/**
* @brief  This function handles I2C3 interrupt.
* @param  None
* @retval None
*/
void I2C3_EV_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C3_INDEX];
  HAL_I2C_EV_IRQHandler(handle);
#if defined(STM32L0xx)
  HAL_I2C_ER_IRQHandler(handle);
#endif /* STM32L0xx */
}

#if !defined(STM32L0xx)
/**
* @brief  This function handles I2C3 interrupt.
* @param  None
* @retval None
*/
void I2C3_ER_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C3_INDEX];
  HAL_I2C_ER_IRQHandler(handle);
}
#endif /* !STM32L0xx */
#endif /* I2C3_BASE && ! STM32G0xx && !STM32U0xx */

#if defined(I2C4_BASE) && !defined(STM32U0xx)
/**
* @brief  This function handles I2C4 interrupt.
* @param  None
* @retval None
*/
void I2C4_EV_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C4_INDEX];
  HAL_I2C_EV_IRQHandler(handle);
  HAL_I2C_ER_IRQHandler(handle);
}

/**
* @brief  This function handles I2C4 interrupt.
* @param  None
* @retval None
*/
void I2C4_ER_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C4_INDEX];
  HAL_I2C_ER_IRQHandler(handle);
}
#endif // I2C4_BASE && !STM32U0xx

#if defined(I2C5_BASE)
/**
* @brief  This function handles I2C5 interrupt.
* @param  None
* @retval None
*/
void I2C5_EV_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C5_INDEX];
  HAL_I2C_EV_IRQHandler(handle);
}

/**
* @brief  This function handles I2C5 interrupt.
* @param  None
* @retval None
*/
void I2C5_ER_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C5_INDEX];
  HAL_I2C_ER_IRQHandler(handle);
}
#endif // I2C5_BASE

#if defined(I2C6_BASE)
/**
* @brief  This function handles I2C6 interrupt.
* @param  None
* @retval None
*/
void I2C6_EV_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C6_INDEX];
  HAL_I2C_EV_IRQHandler(handle);
}

/**
* @brief  This function handles I2C6 interrupt.
* @param  None
* @retval None
*/
void I2C6_ER_IRQHandler(void)
{
  I2C_HandleTypeDef *handle = i2c_handles[I2C6_INDEX];
  HAL_I2C_ER_IRQHandler(handle);
}
#endif // I2C6_BASE

#ifdef __cplusplus
}
#endif

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
